# todo: Определить в коде переменные:
# 1. Целочисленного типа (int)
# 2. Вещественного типа (float)
# 3. Логического типа (bool)
# 4. Строкового типа (str)
# 5. Пустого типа (none)
# Вывести их типы.

int_ls1 = 1
print(int_ls1)
type_ils1=type(int_ls1)
print(type_ils1)

float_ls1 = 1.111
print(float_ls1)
type_fls1=type(float_ls1)
print(type_fls1)

str_ls1 = "Hello world"
print(str_ls1)
type_sls1=type(str_ls1 )
print(type_sls1)

bool_ls1 = True
print(bool_ls1)
type_bls1=type(bool_ls1 )
print(type_bls1)

none_ls1 = None
print(none_ls1)
type_nls1=type(none_ls1 )
print(type_nls1)